grevaillot/svd_tools/headers/STM32H7A3x/flash.h
#pragma once 

/* --- Flash: Flash ------------------------------------------------- */

/** @defgroup flash_registers Flash Register
@{*/

/** Flash_ACR Access control register **/
#define Flash_ACR			MMIO32(Flash_BASE + 0x00)
/** Flash_KEYR1 FLASH key register for bank 1 **/
#define Flash_KEYR1			MMIO32(Flash_BASE + 0x04)
/** Flash_OPTKEYR FLASH option key register **/
#define Flash_OPTKEYR			MMIO32(Flash_BASE + 0x08)
/** Flash_CR1 FLASH control register for bank 1 **/
#define Flash_CR1			MMIO32(Flash_BASE + 0x0c)
/** Flash_SR1 FLASH status register for bank 1 **/
#define Flash_SR1			MMIO32(Flash_BASE + 0x10)
/** Flash_CCR1 FLASH clear control register for bank 1 **/
#define Flash_CCR1			MMIO32(Flash_BASE + 0x14)
/** Flash_OPTCR FLASH option control register **/
#define Flash_OPTCR			MMIO32(Flash_BASE + 0x18)
/** Flash_OPTSR_CUR FLASH option status register **/
#define Flash_OPTSR_CUR			MMIO32(Flash_BASE + 0x1c)
/** Flash_OPTSR_PRG FLASH option status register **/
#define Flash_OPTSR_PRG			MMIO32(Flash_BASE + 0x20)
/** Flash_OPTCCR FLASH option clear control register **/
#define Flash_OPTCCR			MMIO32(Flash_BASE + 0x24)
/** Flash_PRAR_CUR1 FLASH protection address for bank 1 **/
#define Flash_PRAR_CUR1			MMIO32(Flash_BASE + 0x28)
/** Flash_PRAR_PRG1 FLASH protection address for bank 1 **/
#define Flash_PRAR_PRG1			MMIO32(Flash_BASE + 0x2c)
/** Flash_PRAR_PRG2 FLASH protection address for bank 2 **/
#define Flash_PRAR_PRG2			MMIO32(Flash_BASE + 0x2c)
/** Flash_WPSN_CUR1R FLASH write sector protection for bank 1 **/
#define Flash_WPSN_CUR1R			MMIO32(Flash_BASE + 0x38)
/** Flash_WPSN_PRG1R FLASH write sector protection for bank 1 **/
#define Flash_WPSN_PRG1R			MMIO32(Flash_BASE + 0x3c)
/** Flash_BOOT_CURR FLASH register with boot address **/
#define Flash_BOOT_CURR			MMIO32(Flash_BASE + 0x40)
/** Flash_BOOT_PRGR FLASH register with boot address **/
#define Flash_BOOT_PRGR			MMIO32(Flash_BASE + 0x44)
/** Flash_CRCCR1 FLASH CRC control register for bank 1 **/
#define Flash_CRCCR1			MMIO32(Flash_BASE + 0x50)
/** Flash_CRCSADD1R FLASH CRC start address register for bank 1 **/
#define Flash_CRCSADD1R			MMIO32(Flash_BASE + 0x54)
/** Flash_CRCEADD1R FLASH CRC end address register for bank 1 **/
#define Flash_CRCEADD1R			MMIO32(Flash_BASE + 0x58)
/** Flash_CRCDATAR FLASH CRC data register **/
#define Flash_CRCDATAR			MMIO32(Flash_BASE + 0x5c)
/** Flash_ECC_FA1R FLASH ECC fail address for bank 1 **/
#define Flash_ECC_FA1R			MMIO32(Flash_BASE + 0x60)
/** Flash_ACR_ Access control register **/
#define Flash_ACR_			MMIO32(Flash_BASE + 0x100)
/** Flash_KEYR2 FLASH key register for bank 2 **/
#define Flash_KEYR2			MMIO32(Flash_BASE + 0x104)
/** Flash_OPTKEYR_ FLASH option key register **/
#define Flash_OPTKEYR_			MMIO32(Flash_BASE + 0x108)
/** Flash_CR2 FLASH control register for bank 2 **/
#define Flash_CR2			MMIO32(Flash_BASE + 0x10c)
/** Flash_SR2 FLASH status register for bank 2 **/
#define Flash_SR2			MMIO32(Flash_BASE + 0x110)
/** Flash_CCR2 FLASH clear control register for bank 2 **/
#define Flash_CCR2			MMIO32(Flash_BASE + 0x114)
/** Flash_OPTCR_ FLASH option control register **/
#define Flash_OPTCR_			MMIO32(Flash_BASE + 0x118)
/** Flash_OPTSR_CUR_ FLASH option status register **/
#define Flash_OPTSR_CUR_			MMIO32(Flash_BASE + 0x11c)
/** Flash_OPTSR_PRG_ FLASH option status register **/
#define Flash_OPTSR_PRG_			MMIO32(Flash_BASE + 0x120)
/** Flash_OPTCCR_ FLASH option clear control register **/
#define Flash_OPTCCR_			MMIO32(Flash_BASE + 0x124)
/** Flash_PRAR_CUR2 FLASH protection address for bank 1 **/
#define Flash_PRAR_CUR2			MMIO32(Flash_BASE + 0x128)
/** Flash_WPSN_CUR2R FLASH write sector protection for bank 2 **/
#define Flash_WPSN_CUR2R			MMIO32(Flash_BASE + 0x138)
/** Flash_WPSN_PRG2R FLASH write sector protection for bank 2 **/
#define Flash_WPSN_PRG2R			MMIO32(Flash_BASE + 0x13c)
/** Flash_CRCCR2 FLASH CRC control register for bank 1 **/
#define Flash_CRCCR2			MMIO32(Flash_BASE + 0x150)
/** Flash_CRCSADD2R FLASH CRC start address register for bank 2 **/
#define Flash_CRCSADD2R			MMIO32(Flash_BASE + 0x154)
/** Flash_CRCEADD2R FLASH CRC end address register for bank 2 **/
#define Flash_CRCEADD2R			MMIO32(Flash_BASE + 0x158)
/** Flash_ECC_FA2R FLASH ECC fail address for bank 2 **/
#define Flash_ECC_FA2R			MMIO32(Flash_BASE + 0x160)

/**@}*/


/** @defgroup flash_acr ACR Access control register
@{*/


#define Flash_ACR_WRHIGHFREQ_SHIFT		4
#define Flash_ACR_WRHIGHFREQ_MASK		0x03
/** @defgroup flash_acr_wrhighfreq WRHIGHFREQ Flash signal delay
@{*/
/**@}*/


#define Flash_ACR_LATENCY_SHIFT		0
#define Flash_ACR_LATENCY_MASK		0x07
/** @defgroup flash_acr_latency LATENCY Read latency
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_keyr1 KEYR1 FLASH key register for bank 1
@{*/


#define Flash_KEYR1_KEYR1_SHIFT		0
#define Flash_KEYR1_KEYR1_MASK		0xffffffff
/** @defgroup flash_keyr1_keyr1 KEYR1 Bank 1 access configuration unlock key
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_optkeyr OPTKEYR FLASH option key register
@{*/


#define Flash_OPTKEYR_OPTKEYR_SHIFT		0
#define Flash_OPTKEYR_OPTKEYR_MASK		0xffffffff
/** @defgroup flash_optkeyr_optkeyr OPTKEYR Unlock key option bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_cr1 CR1 FLASH control register for bank 1
@{*/

/** Flash_CR1_CRCENDIE1 Bank 1 end of CRC calculation interrupt enable bit **/
#define Flash_CR1_CRCENDIE1		(1 << 27)
/** Flash_CR1_DBECCERRIE1 Bank 1 ECC double detection error interrupt enable bit **/
#define Flash_CR1_DBECCERRIE1		(1 << 26)
/** Flash_CR1_SNECCERRIE1 Bank 1 ECC single correction error interrupt enable bit **/
#define Flash_CR1_SNECCERRIE1		(1 << 25)
/** Flash_CR1_RDSERRIE1 Bank 1 secure error interrupt enable bit **/
#define Flash_CR1_RDSERRIE1		(1 << 24)
/** Flash_CR1_RDPERRIE1 Bank 1 read protection error interrupt enable bit **/
#define Flash_CR1_RDPERRIE1		(1 << 23)
/** Flash_CR1_OPERRIE1 Bank 1 write/erase error interrupt enable bit **/
#define Flash_CR1_OPERRIE1		(1 << 22)
/** Flash_CR1_INCERRIE1 Bank 1 inconsistency error interrupt enable bit **/
#define Flash_CR1_INCERRIE1		(1 << 21)
/** Flash_CR1_STRBERRIE1 Bank 1 strobe error interrupt enable bit **/
#define Flash_CR1_STRBERRIE1		(1 << 19)
/** Flash_CR1_PGSERRIE1 Bank 1 programming sequence error interrupt enable bit **/
#define Flash_CR1_PGSERRIE1		(1 << 18)
/** Flash_CR1_WRPERRIE1 Bank 1 write protection error interrupt enable bit **/
#define Flash_CR1_WRPERRIE1		(1 << 17)
/** Flash_CR1_EOPIE1 Bank 1 end-of-program interrupt control bit **/
#define Flash_CR1_EOPIE1		(1 << 16)
/** Flash_CR1_CRC_EN Bank 1 CRC control bit **/
#define Flash_CR1_CRC_EN		(1 << 15)

#define Flash_CR1_SNB1_SHIFT		8
#define Flash_CR1_SNB1_MASK		0x07
/** @defgroup flash_cr1_snb1 SNB1 Bank 1 sector erase selection number
@{*/
/**@}*/

/** Flash_CR1_START1 Bank 1 bank or sector erase start control bit **/
#define Flash_CR1_START1		(1 << 7)
/** Flash_CR1_FW1 Bank 1 write forcing control bit **/
#define Flash_CR1_FW1		(1 << 6)

#define Flash_CR1_PSIZE1_SHIFT		4
#define Flash_CR1_PSIZE1_MASK		0x03
/** @defgroup flash_cr1_psize1 PSIZE1 Bank 1 program size
@{*/
/**@}*/

/** Flash_CR1_BER1 Bank 1 erase request **/
#define Flash_CR1_BER1		(1 << 3)
/** Flash_CR1_SER1 Bank 1 sector erase request **/
#define Flash_CR1_SER1		(1 << 2)
/** Flash_CR1_PG1 Bank 1 program enable bit **/
#define Flash_CR1_PG1		(1 << 1)
/** Flash_CR1_LOCK1 Bank 1 configuration lock bit **/
#define Flash_CR1_LOCK1		(1 << 0)

/**@}*/

/** @defgroup flash_sr1 SR1 FLASH status register for bank 1
@{*/

/** Flash_SR1_CRCEND1 Bank 1 CRC-complete flag **/
#define Flash_SR1_CRCEND1		(1 << 27)
/** Flash_SR1_DBECCERR1 Bank 1 ECC double detection error flag **/
#define Flash_SR1_DBECCERR1		(1 << 26)
/** Flash_SR1_SNECCERR11 Bank 1 single correction error flag **/
#define Flash_SR1_SNECCERR11		(1 << 25)
/** Flash_SR1_RDSERR1 Bank 1 secure error flag **/
#define Flash_SR1_RDSERR1		(1 << 24)
/** Flash_SR1_RDPERR1 Bank 1 read protection error flag **/
#define Flash_SR1_RDPERR1		(1 << 23)
/** Flash_SR1_OPERR1 Bank 1 write/erase error flag **/
#define Flash_SR1_OPERR1		(1 << 22)
/** Flash_SR1_INCERR1 Bank 1 inconsistency error flag **/
#define Flash_SR1_INCERR1		(1 << 21)
/** Flash_SR1_STRBERR1 Bank 1 strobe error flag **/
#define Flash_SR1_STRBERR1		(1 << 19)
/** Flash_SR1_PGSERR1 Bank 1 programming sequence error flag **/
#define Flash_SR1_PGSERR1		(1 << 18)
/** Flash_SR1_WRPERR1 Bank 1 write protection error flag **/
#define Flash_SR1_WRPERR1		(1 << 17)
/** Flash_SR1_EOP1 Bank 1 end-of-program flag **/
#define Flash_SR1_EOP1		(1 << 16)
/** Flash_SR1_CRC_BUSY1 Bank 1 CRC busy flag **/
#define Flash_SR1_CRC_BUSY1		(1 << 3)
/** Flash_SR1_QW1 Bank 1 wait queue flag **/
#define Flash_SR1_QW1		(1 << 2)
/** Flash_SR1_WBNE1 Bank 1 write buffer not empty flag **/
#define Flash_SR1_WBNE1		(1 << 1)
/** Flash_SR1_BSY1 Bank 1 ongoing program flag **/
#define Flash_SR1_BSY1		(1 << 0)

/**@}*/

/** @defgroup flash_ccr1 CCR1 FLASH clear control register for bank 1
@{*/

