grevaillot/svd_tools/headers/STM32H7A3x/flash.h
/** Flash_PRAR_PRG1_DMEP1 Bank 1 PCROP protected erase enable option configuration bit **/
#define Flash_PRAR_PRG1_DMEP1		(1 << 31)

#define Flash_PRAR_PRG1_PROT_AREA_END1_SHIFT		16
#define Flash_PRAR_PRG1_PROT_AREA_END1_MASK		0xfff
/** @defgroup flash_prar_prg1_prot_area_end1 PROTAREAEND1 Bank 1 highest PCROP protected address configuration
@{*/
/**@}*/


#define Flash_PRAR_PRG1_PROT_AREA_START1_SHIFT		0
#define Flash_PRAR_PRG1_PROT_AREA_START1_MASK		0xfff
/** @defgroup flash_prar_prg1_prot_area_start1 PROTAREASTART1 Bank 1 lowest PCROP protected address configuration
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_prar_prg2 PRARPRG2 FLASH protection address for bank 2
@{*/

/** Flash_PRAR_PRG2_DMEP2 Bank 2 PCROP protected erase enable option configuration bit **/
#define Flash_PRAR_PRG2_DMEP2		(1 << 31)

#define Flash_PRAR_PRG2_PROT_AREA_END2_SHIFT		16
#define Flash_PRAR_PRG2_PROT_AREA_END2_MASK		0xfff
/** @defgroup flash_prar_prg2_prot_area_end2 PROTAREAEND2 Bank 2 highest PCROP protected address configuration
@{*/
/**@}*/


#define Flash_PRAR_PRG2_PROT_AREA_START2_SHIFT		0
#define Flash_PRAR_PRG2_PROT_AREA_START2_MASK		0xfff
/** @defgroup flash_prar_prg2_prot_area_start2 PROTAREASTART2 Bank 2 lowest PCROP protected address configuration
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_wpsn_cur1r WPSNCUR1R FLASH write sector protection for bank 1
@{*/


#define Flash_WPSN_CUR1R_WRPSn1_SHIFT		0
#define Flash_WPSN_CUR1R_WRPSn1_MASK		0xff
/** @defgroup flash_wpsn_cur1r_wrpsn1 WRPSn1 Bank 1 sector write protection option status byte
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_wpsn_prg1r WPSNPRG1R FLASH write sector protection for bank 1
@{*/


#define Flash_WPSN_PRG1R_WRPSn1_SHIFT		0
#define Flash_WPSN_PRG1R_WRPSn1_MASK		0xff
/** @defgroup flash_wpsn_prg1r_wrpsn1 WRPSn1 Bank 1 sector write protection configuration byte
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_boot_curr BOOTCURR FLASH register with boot address
@{*/


#define Flash_BOOT_CURR_BOOT_ADD1_SHIFT		16
#define Flash_BOOT_CURR_BOOT_ADD1_MASK		0xffff
/** @defgroup flash_boot_curr_boot_add1 BOOTADD1 Boot address 1
@{*/
/**@}*/


#define Flash_BOOT_CURR_BOOT_ADD0_SHIFT		0
#define Flash_BOOT_CURR_BOOT_ADD0_MASK		0xffff
/** @defgroup flash_boot_curr_boot_add0 BOOTADD0 Boot address 0
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_boot_prgr BOOTPRGR FLASH register with boot address
@{*/


#define Flash_BOOT_PRGR_BOOT_ADD1_SHIFT		16
#define Flash_BOOT_PRGR_BOOT_ADD1_MASK		0xffff
/** @defgroup flash_boot_prgr_boot_add1 BOOTADD1 Boot address 1
@{*/
/**@}*/


#define Flash_BOOT_PRGR_BOOT_ADD0_SHIFT		0
#define Flash_BOOT_PRGR_BOOT_ADD0_MASK		0xffff
/** @defgroup flash_boot_prgr_boot_add0 BOOTADD0 Boot address 0
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_crccr1 CRCCR1 FLASH CRC control register for bank 1
@{*/


#define Flash_CRCCR1_CRC_BURST_SHIFT		20
#define Flash_CRCCR1_CRC_BURST_MASK		0x03
/** @defgroup flash_crccr1_crc_burst CRCBURST Bank 1 CRC burst size
@{*/
/**@}*/

/** Flash_CRCCR1_CLEAN_CRC Bank 1 CRC clear bit **/
#define Flash_CRCCR1_CLEAN_CRC		(1 << 17)
/** Flash_CRCCR1_START_CRC Bank 1 CRC start bit **/
#define Flash_CRCCR1_START_CRC		(1 << 16)
/** Flash_CRCCR1_CLEAN_SECT Bank 1 CRC sector list clear bit **/
#define Flash_CRCCR1_CLEAN_SECT		(1 << 10)
/** Flash_CRCCR1_ADD_SECT Bank 1 CRC sector select bit **/
#define Flash_CRCCR1_ADD_SECT		(1 << 9)
/** Flash_CRCCR1_CRC_BY_SECT Bank 1 CRC sector mode select bit **/
#define Flash_CRCCR1_CRC_BY_SECT		(1 << 8)
/** Flash_CRCCR1_ALL_BANK Bank 1 CRC select bit **/
#define Flash_CRCCR1_ALL_BANK		(1 << 7)

#define Flash_CRCCR1_CRC_SECT_SHIFT		0
#define Flash_CRCCR1_CRC_SECT_MASK		0x07
/** @defgroup flash_crccr1_crc_sect CRCSECT Bank 1 CRC sector number
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_crcsadd1r CRCSADD1R FLASH CRC start address register for bank 1
@{*/


#define Flash_CRCSADD1R_CRC_START_ADDR_SHIFT		0
#define Flash_CRCSADD1R_CRC_START_ADDR_MASK		0xffffffff
/** @defgroup flash_crcsadd1r_crc_start_addr CRCSTARTADDR CRC start address on bank 1
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_crceadd1r CRCEADD1R FLASH CRC end address register for bank 1
@{*/


#define Flash_CRCEADD1R_CRC_END_ADDR_SHIFT		0
#define Flash_CRCEADD1R_CRC_END_ADDR_MASK		0xffffffff
/** @defgroup flash_crceadd1r_crc_end_addr CRCENDADDR CRC end address on bank 1
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_crcdatar CRCDATAR FLASH CRC data register
@{*/


#define Flash_CRCDATAR_CRC_DATA_SHIFT		0
#define Flash_CRCDATAR_CRC_DATA_MASK		0xffffffff
/** @defgroup flash_crcdatar_crc_data CRCDATA CRC result
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_ecc_fa1r ECCFA1R FLASH ECC fail address for bank 1
@{*/


#define Flash_ECC_FA1R_FAIL_ECC_ADDR1_SHIFT		0
#define Flash_ECC_FA1R_FAIL_ECC_ADDR1_MASK		0x7fff
/** @defgroup flash_ecc_fa1r_fail_ecc_addr1 FAILECCADDR1 Bank 1 ECC error address
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_acr_ ACR Access control register
@{*/


#define Flash_ACR__WRHIGHFREQ_SHIFT		4
#define Flash_ACR__WRHIGHFREQ_MASK		0x03
/** @defgroup flash_acr__wrhighfreq WRHIGHFREQ Flash signal delay
@{*/
/**@}*/


#define Flash_ACR__LATENCY_SHIFT		0
#define Flash_ACR__LATENCY_MASK		0x07
/** @defgroup flash_acr__latency LATENCY Read latency
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_keyr2 KEYR2 FLASH key register for bank 2
@{*/


#define Flash_KEYR2_KEYR2_SHIFT		0
#define Flash_KEYR2_KEYR2_MASK		0xffffffff
/** @defgroup flash_keyr2_keyr2 KEYR2 Bank 2 access configuration unlock key
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_optkeyr_ OPTKEYR FLASH option key register
@{*/


#define Flash_OPTKEYR__OPTKEYR_SHIFT		0
#define Flash_OPTKEYR__OPTKEYR_MASK		0xffffffff
/** @defgroup flash_optkeyr__optkeyr OPTKEYR Unlock key option bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_cr2 CR2 FLASH control register for bank 2
@{*/

/** Flash_CR2_CRCENDIE2 Bank 2 end of CRC calculation interrupt enable bit **/
#define Flash_CR2_CRCENDIE2		(1 << 27)
/** Flash_CR2_DBECCERRIE2 Bank 2 ECC double detection error interrupt enable bit **/
#define Flash_CR2_DBECCERRIE2		(1 << 26)
/** Flash_CR2_SNECCERRIE2 Bank 2 ECC single correction error interrupt enable bit **/
#define Flash_CR2_SNECCERRIE2		(1 << 25)
/** Flash_CR2_RDSERRIE2 Bank 2 secure error interrupt enable bit **/
#define Flash_CR2_RDSERRIE2		(1 << 24)
/** Flash_CR2_RDPERRIE2 Bank 2 read protection error interrupt enable bit **/
#define Flash_CR2_RDPERRIE2		(1 << 23)
/** Flash_CR2_OPERRIE2 Bank 2 write/erase error interrupt enable bit **/
#define Flash_CR2_OPERRIE2		(1 << 22)
/** Flash_CR2_INCERRIE2 Bank 2 inconsistency error interrupt enable bit **/
#define Flash_CR2_INCERRIE2		(1 << 21)
/** Flash_CR2_STRBERRIE2 Bank 2 strobe error interrupt enable bit **/
#define Flash_CR2_STRBERRIE2		(1 << 19)
/** Flash_CR2_PGSERRIE2 Bank 2 programming sequence error interrupt enable bit **/
#define Flash_CR2_PGSERRIE2		(1 << 18)
/** Flash_CR2_WRPERRIE2 Bank 2 write protection error interrupt enable bit **/
#define Flash_CR2_WRPERRIE2		(1 << 17)
/** Flash_CR2_EOPIE2 Bank 2 end-of-program interrupt control bit **/
#define Flash_CR2_EOPIE2		(1 << 16)
/** Flash_CR2_CRC_EN Bank 2 CRC control bit **/
#define Flash_CR2_CRC_EN		(1 << 15)

#define Flash_CR2_SNB2_SHIFT		8
#define Flash_CR2_SNB2_MASK		0x07
/** @defgroup flash_cr2_snb2 SNB2 Bank 2 sector erase selection number
@{*/
/**@}*/

/** Flash_CR2_START2 Bank 2 bank or sector erase start control bit **/
#define Flash_CR2_START2		(1 << 7)
/** Flash_CR2_FW2 Bank 2 write forcing control bit **/
#define Flash_CR2_FW2		(1 << 6)

