grevaillot/svd_tools/headers/STM32H7A3x/flash.h
/** Flash_OPTSR_PRG__FZ_IWDG_SDBY IWDG Standby mode freeze option configuration bit **/
#define Flash_OPTSR_PRG__FZ_IWDG_SDBY		(1 << 18)
/** Flash_OPTSR_PRG__FZ_IWDG_STOP IWDG Stop mode freeze option configuration bit **/
#define Flash_OPTSR_PRG__FZ_IWDG_STOP		(1 << 17)

#define Flash_OPTSR_PRG__RDP_SHIFT		8
#define Flash_OPTSR_PRG__RDP_MASK		0xff
/** @defgroup flash_optsr_prg__rdp RDP Readout protection level option configuration byte
@{*/
/**@}*/

/** Flash_OPTSR_PRG__nRST_STBY_D1 Option byte erase after D1 DStandby option configuration bit **/
#define Flash_OPTSR_PRG__nRST_STBY_D1		(1 << 7)
/** Flash_OPTSR_PRG__nRST_STOP_D1 Option byte erase after D1 DStop option configuration bit **/
#define Flash_OPTSR_PRG__nRST_STOP_D1		(1 << 6)
/** Flash_OPTSR_PRG__IWDG1_HW IWDG1 option configuration bit **/
#define Flash_OPTSR_PRG__IWDG1_HW		(1 << 4)

#define Flash_OPTSR_PRG__BOR_LEV_SHIFT		2
#define Flash_OPTSR_PRG__BOR_LEV_MASK		0x03
/** @defgroup flash_optsr_prg__bor_lev BORLEV BOR reset level option configuration bits
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_optccr_ OPTCCR FLASH option clear control register
@{*/

/** Flash_OPTCCR__CLR_OPTCHANGEERR OPTCHANGEERR reset bit **/
#define Flash_OPTCCR__CLR_OPTCHANGEERR		(1 << 30)

/**@}*/

/** @defgroup flash_prar_cur2 PRARCUR2 FLASH protection address for bank 1
@{*/

/** Flash_PRAR_CUR2_DMEP2 Bank 2 PCROP protected erase enable option status bit **/
#define Flash_PRAR_CUR2_DMEP2		(1 << 31)

#define Flash_PRAR_CUR2_PROT_AREA_END2_SHIFT		16
#define Flash_PRAR_CUR2_PROT_AREA_END2_MASK		0xfff
/** @defgroup flash_prar_cur2_prot_area_end2 PROTAREAEND2 Bank 2 highest PCROP protected address
@{*/
/**@}*/


#define Flash_PRAR_CUR2_PROT_AREA_START2_SHIFT		0
#define Flash_PRAR_CUR2_PROT_AREA_START2_MASK		0xfff
/** @defgroup flash_prar_cur2_prot_area_start2 PROTAREASTART2 Bank 2 lowest PCROP protected address
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_wpsn_cur2r WPSNCUR2R FLASH write sector protection for bank 2
@{*/


#define Flash_WPSN_CUR2R_WRPSn2_SHIFT		0
#define Flash_WPSN_CUR2R_WRPSn2_MASK		0xff
/** @defgroup flash_wpsn_cur2r_wrpsn2 WRPSn2 Bank 2 sector write protection option status byte
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_wpsn_prg2r WPSNPRG2R FLASH write sector protection for bank 2
@{*/


#define Flash_WPSN_PRG2R_WRPSn2_SHIFT		0
#define Flash_WPSN_PRG2R_WRPSn2_MASK		0xff
/** @defgroup flash_wpsn_prg2r_wrpsn2 WRPSn2 Bank 2 sector write protection configuration byte
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_crccr2 CRCCR2 FLASH CRC control register for bank 1
@{*/


#define Flash_CRCCR2_CRC_BURST_SHIFT		20
#define Flash_CRCCR2_CRC_BURST_MASK		0x03
/** @defgroup flash_crccr2_crc_burst CRCBURST Bank 2 CRC burst size
@{*/
/**@}*/

/** Flash_CRCCR2_CLEAN_CRC Bank 2 CRC clear bit **/
#define Flash_CRCCR2_CLEAN_CRC		(1 << 17)
/** Flash_CRCCR2_START_CRC Bank 2 CRC start bit **/
#define Flash_CRCCR2_START_CRC		(1 << 16)
/** Flash_CRCCR2_CLEAN_SECT Bank 2 CRC sector list clear bit **/
#define Flash_CRCCR2_CLEAN_SECT		(1 << 10)
/** Flash_CRCCR2_ADD_SECT Bank 2 CRC sector select bit **/
#define Flash_CRCCR2_ADD_SECT		(1 << 9)
/** Flash_CRCCR2_CRC_BY_SECT Bank 2 CRC sector mode select bit **/
#define Flash_CRCCR2_CRC_BY_SECT		(1 << 8)
/** Flash_CRCCR2_ALL_BANK Bank 2 CRC select bit **/
#define Flash_CRCCR2_ALL_BANK		(1 << 7)

#define Flash_CRCCR2_CRC_SECT_SHIFT		0
#define Flash_CRCCR2_CRC_SECT_MASK		0x07
/** @defgroup flash_crccr2_crc_sect CRCSECT Bank 2 CRC sector number
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_crcsadd2r CRCSADD2R FLASH CRC start address register for bank 2
@{*/


#define Flash_CRCSADD2R_CRC_START_ADDR_SHIFT		0
#define Flash_CRCSADD2R_CRC_START_ADDR_MASK		0xffffffff
/** @defgroup flash_crcsadd2r_crc_start_addr CRCSTARTADDR CRC start address on bank 2
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_crceadd2r CRCEADD2R FLASH CRC end address register for bank 2
@{*/


#define Flash_CRCEADD2R_CRC_END_ADDR_SHIFT		0
#define Flash_CRCEADD2R_CRC_END_ADDR_MASK		0xffffffff
/** @defgroup flash_crceadd2r_crc_end_addr CRCENDADDR CRC end address on bank 2
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_ecc_fa2r ECCFA2R FLASH ECC fail address for bank 2
@{*/


#define Flash_ECC_FA2R_FAIL_ECC_ADDR2_SHIFT		0
#define Flash_ECC_FA2R_FAIL_ECC_ADDR2_MASK		0x7fff
/** @defgroup flash_ecc_fa2r_fail_ecc_addr2 FAILECCADDR2 Bank 2 ECC error address
@{*/
/**@}*/


/**@}*/
